InformationRegisters/СпособыОтраженияРасходовПоИмущественнымНалогам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СпособыОтраженияРасходовПоИмущественнымНалогам</Name>
			<Comment>Настройка отражения в учете расходов по имущественным налогам</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияРасходовЗаданДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияЗемельныхУчастков</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеСпособаОтраженияИмущественныхНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеПараметровОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпособыОтраженияРасходовПоИмущественнымНалогам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.СпособыОтраженияРасходовПоИмущественнымНалогам";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРегистра.Регистратор
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоИмущественнымНалогам КАК ТаблицаРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияТранспортныхСредств.ОтражениеРасходов КАК ТЧРегистрацияТранспортныхСредств
	|		ПО (ТЧРегистрацияТранспортныхСредств.Ссылка = ТаблицаРегистра.СпособОтраженияРасходов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.ОтражениеРасходов КАК ТЧРегистрацияПорядкаНалогообложенияПоНалогуНаИмущество
	|		ПО (ТЧРегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.Ссылка = ТаблицаРегистра.СпособОтраженияРасходов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияЗемельныхУчастков.ОтражениеРасходов КАК ТЧРегистрацияЗемельныхУчастков
	|		ПО (ТЧРегистрацияЗемельныхУчастков.Ссылка = ТаблицаРегистра.СпособОтраженияРасходов)
	|ГДЕ
	|	ТаблицаРегистра.СпособОтраженияРасходовЗаданДокументом
	|
	|	И (ТаблицаРегистра.Регистратор ССЫЛКА Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество
	|			ИЛИ ТаблицаРегистра.Регистратор ССЫЛКА Документ.РегистрацияТранспортныхСредств
	|			ИЛИ ТаблицаРегистра.Регистратор ССЫЛКА Документ.РегистрацияЗемельныхУчастков)
	|
	|	И (ТаблицаРегистра.СпособОтраженияРасходов ССЫЛКА Документ.РегистрацияТранспортныхСредств
	|				И ТЧРегистрацияТранспортныхСредств.Ссылка ЕСТЬ NULL
	|			ИЛИ ТаблицаРегистра.СпособОтраженияРасходов ССЫЛКА Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество
	|				И ТЧРегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.Ссылка ЕСТЬ NULL
	|			ИЛИ ТаблицаРегистра.СпособОтраженияРасходов ССЫЛКА Документ.РегистрацияЗемельныхУчастков
	|				И ТЧРегистрацияЗемельныхУчастков.Ссылка ЕСТЬ NULL)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
		
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество");
	Регистраторы.Добавить("Документ.РегистрацияТранспортныхСредств");
	Регистраторы.Добавить("Документ.РегистрацияЗемельныхУчастков");
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы,
	    "РегистрСведений.СпособыОтраженияРасходовПоИмущественнымНалогам",
	    Параметры.Очередь);
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
